4ms/mdrivlib/tests/ext/HAL/stm32f7xx_hal_conf.h
	/* Tip: To avoid modifying this file each time you need to use different HSE,
   ===  you can define the HSE value in your toolchain compiler preprocessor. */

	/* ########################### System Configuration ######################### */
	/**
  * @brief This is the HAL system configuration section
  */
	#define VDD_VALUE 3300U			/*!< Value of VDD in mv */
	#define TICK_INT_PRIORITY 0x0FU /*!< tick interrupt priority */
	#define USE_RTOS 0U
	#define PREFETCH_ENABLE 1U		 /* To enable prefetch */
	#define ART_ACCLERATOR_ENABLE 1U /* To enable ART Accelerator */

	#define USE_HAL_ADC_REGISTER_CALLBACKS 0U		/* ADC register callback disabled     */
	#define USE_HAL_CEC_REGISTER_CALLBACKS 0U		/* CEC register callback disabled     */
	#define USE_HAL_COMP_REGISTER_CALLBACKS 0U		/* COMP register callback disabled    */
	#define USE_HAL_CRYP_REGISTER_CALLBACKS 0U		/* CRYP register callback disabled    */
	#define USE_HAL_DAC_REGISTER_CALLBACKS 0U		/* DAC register callback disabled     */
	#define USE_HAL_DCMI_REGISTER_CALLBACKS 0U		/* DCMI register callback disabled    */
	#define USE_HAL_DFSDM_REGISTER_CALLBACKS 0U		/* DFSDM register callback disabled   */
	#define USE_HAL_DMA2D_REGISTER_CALLBACKS 0U		/* DMA2D register callback disabled   */
	#define USE_HAL_DSI_REGISTER_CALLBACKS 0U		/* DSI register callback disabled     */
	#define USE_HAL_DTS_REGISTER_CALLBACKS 0U		/* DTS register callback disabled     */
	#define USE_HAL_ETH_REGISTER_CALLBACKS 0U		/* ETH register callback disabled     */
	#define USE_HAL_FDCAN_REGISTER_CALLBACKS 0U		/* FDCAN register callback disabled   */
	#define USE_HAL_NAND_REGISTER_CALLBACKS 0U		/* NAND register callback disabled    */
	#define USE_HAL_NOR_REGISTER_CALLBACKS 0U		/* NOR register callback disabled     */
	#define USE_HAL_SDRAM_REGISTER_CALLBACKS 0U		/* SDRAM register callback disabled   */
	#define USE_HAL_SRAM_REGISTER_CALLBACKS 0U		/* SRAM register callback disabled    */
	#define USE_HAL_HASH_REGISTER_CALLBACKS 0U		/* HASH register callback disabled    */
	#define USE_HAL_HCD_REGISTER_CALLBACKS 0U		/* HCD register callback disabled     */
	#define USE_HAL_GFXMMU_REGISTER_CALLBACKS 0U	/* GFXMMU register callback disabled  */
	#define USE_HAL_HRTIM_REGISTER_CALLBACKS 0U		/* HRTIM register callback disabled   */
	#define USE_HAL_I2C_REGISTER_CALLBACKS 0U		/* I2C register callback disabled     */
	#define USE_HAL_I2S_REGISTER_CALLBACKS 0U		/* I2S register callback disabled     */
	#define USE_HAL_IRDA_REGISTER_CALLBACKS 0U		/* IRDA register callback disabled    */
	#define USE_HAL_JPEG_REGISTER_CALLBACKS 0U		/* JPEG register callback disabled    */
	#define USE_HAL_LPTIM_REGISTER_CALLBACKS 0U		/* LPTIM register callback disabled   */
	#define USE_HAL_LTDC_REGISTER_CALLBACKS 0U		/* LTDC register callback disabled    */
	#define USE_HAL_MDIOS_REGISTER_CALLBACKS 0U		/* MDIO register callback disabled    */
	#define USE_HAL_MMC_REGISTER_CALLBACKS 0U		/* MMC register callback disabled     */
	#define USE_HAL_OPAMP_REGISTER_CALLBACKS 0U		/* MDIO register callback disabled    */
	#define USE_HAL_OSPI_REGISTER_CALLBACKS 0U		/* OSPI register callback disabled    */
	#define USE_HAL_OTFDEC_REGISTER_CALLBACKS 0U	/* OTFDEC register callback disabled  */
	#define USE_HAL_PCD_REGISTER_CALLBACKS 0U		/* PCD register callback disabled     */
	#define USE_HAL_QSPI_REGISTER_CALLBACKS 0U		/* QSPI register callback disabled    */
	#define USE_HAL_RNG_REGISTER_CALLBACKS 0U		/* RNG register callback disabled     */
	#define USE_HAL_RTC_REGISTER_CALLBACKS 0U		/* RTC register callback disabled     */
	#define USE_HAL_SAI_REGISTER_CALLBACKS 0U		/* SAI register callback disabled     */
	#define USE_HAL_SD_REGISTER_CALLBACKS 0U		/* SD register callback disabled      */
	#define USE_HAL_SMARTCARD_REGISTER_CALLBACKS 0U /* SMARTCARD register callback disabled */
	#define USE_HAL_SPDIFRX_REGISTER_CALLBACKS 0U	/* SPDIFRX register callback disabled */
	#define USE_HAL_SMBUS_REGISTER_CALLBACKS 0U		/* SMBUS register callback disabled   */
	#define USE_HAL_SPI_REGISTER_CALLBACKS 0U		/* SPI register callback disabled     */
	#define USE_HAL_SWPMI_REGISTER_CALLBACKS 0U		/* SWPMI register callback disabled   */
	#define USE_HAL_TIM_REGISTER_CALLBACKS 0U		/* TIM register callback disabled     */
	#define USE_HAL_UART_REGISTER_CALLBACKS 0U		/* UART register callback disabled    */
	#define USE_HAL_USART_REGISTER_CALLBACKS 0U		/* USART register callback disabled   */
	#define USE_HAL_WWDG_REGISTER_CALLBACKS 0U		/* WWDG register callback disabled    */

	/* ########################## Assert Selection ############################## */
	/**
  * @brief Uncomment the line below to expanse the "assert_param" macro in the 
  *        HAL drivers code
  */
	/* #define USE_FULL_ASSERT    1 */

	/* ################## Ethernet peripheral configuration ##################### */

	/* Section 1 : Ethernet peripheral configuration */

	/* MAC ADDRESS: MAC_ADDR0:MAC_ADDR1:MAC_ADDR2:MAC_ADDR3:MAC_ADDR4:MAC_ADDR5 */
	#define MAC_ADDR0 2U
	#define MAC_ADDR1 0U
	#define MAC_ADDR2 0U
	#define MAC_ADDR3 0U
	#define MAC_ADDR4 0U
	#define MAC_ADDR5 0U

	/* Definition of the Ethernet driver buffers size and count */
	#define ETH_RX_BUF_SIZE ETH_MAX_PACKET_SIZE /* buffer size for receive               */
	#define ETH_TX_BUF_SIZE ETH_MAX_PACKET_SIZE /* buffer size for transmit              */
	#define ETH_RXBUFNB 4U						/* 4 Rx buffers of size ETH_RX_BUF_SIZE  */
	#define ETH_TXBUFNB 4U						/* 4 Tx buffers of size ETH_TX_BUF_SIZE  */

	/* Section 2: PHY configuration section */

	/* DP83848 PHY Address*/
	#define DP83848_PHY_ADDRESS 0x01U
	/* PHY Reset delay these values are based on a 1 ms Systick interrupt*/
	#define PHY_RESET_DELAY 0x000000FFU
	/* PHY Configuration delay */
	#define PHY_CONFIG_DELAY 0x00000FFFU

	#define PHY_READ_TO 0x0000FFFFU
	#define PHY_WRITE_TO 0x0000FFFFU

/* Section 3: Common PHY Registers */

	#define PHY_BCR ((uint16_t)0x00U) /*!< Transceiver Basic Control Register   */
	#define PHY_BSR ((uint16_t)0x01U) /*!< Transceiver Basic Status Register    */

