4ms/mdrivlib/tests/ext/HAL/stm32f7xx_hal_conf.h
	#define PHY_RESET ((uint16_t)0x8000U)					/*!< PHY Reset */
	#define PHY_LOOPBACK ((uint16_t)0x4000U)				/*!< Select loop-back mode */
	#define PHY_FULLDUPLEX_100M ((uint16_t)0x2100U)			/*!< Set the full-duplex mode at 100 Mb/s */
	#define PHY_HALFDUPLEX_100M ((uint16_t)0x2000U)			/*!< Set the half-duplex mode at 100 Mb/s */
	#define PHY_FULLDUPLEX_10M ((uint16_t)0x0100U)			/*!< Set the full-duplex mode at 10 Mb/s  */
	#define PHY_HALFDUPLEX_10M ((uint16_t)0x0000U)			/*!< Set the half-duplex mode at 10 Mb/s  */
	#define PHY_AUTONEGOTIATION ((uint16_t)0x1000U)			/*!< Enable auto-negotiation function     */
	#define PHY_RESTART_AUTONEGOTIATION ((uint16_t)0x0200U) /*!< Restart auto-negotiation function    */
	#define PHY_POWERDOWN ((uint16_t)0x0800U)				/*!< Select the power down mode           */
	#define PHY_ISOLATE ((uint16_t)0x0400U)					/*!< Isolate PHY from MII                 */

	#define PHY_AUTONEGO_COMPLETE ((uint16_t)0x0020U) /*!< Auto-Negotiation process completed   */
	#define PHY_LINKED_STATUS ((uint16_t)0x0004U)	  /*!< Valid link established               */
	#define PHY_JABBER_DETECTION ((uint16_t)0x0002U)  /*!< Jabber condition detected            */

/* Section 4: Extended PHY Registers */

	#define PHY_SR ((uint16_t)0x10U)   /*!< PHY status register Offset                      */
	#define PHY_MICR ((uint16_t)0x11U) /*!< MII Interrupt Control Register                  */
	#define PHY_MISR ((uint16_t)0x12U) /*!< MII Interrupt Status and Misc. Control Register */

	#define PHY_LINK_STATUS ((uint16_t)0x0001U)	  /*!< PHY Link mask                                   */
	#define PHY_SPEED_STATUS ((uint16_t)0x0002U)  /*!< PHY Speed mask                                  */
	#define PHY_DUPLEX_STATUS ((uint16_t)0x0004U) /*!< PHY Duplex mask                                 */

	#define PHY_MICR_INT_EN ((uint16_t)0x0002U) /*!< PHY Enable interrupts                           */
	#define PHY_MICR_INT_OE ((uint16_t)0x0001U) /*!< PHY Enable output interrupt events              */

	#define PHY_MISR_LINK_INT_EN ((uint16_t)0x0020U) /*!< Enable Interrupt on change of link status       */
	#define PHY_LINK_INTERRUPT ((uint16_t)0x2000U)	 /*!< PHY link status interrupt mask                  */

/* ################## SPI peripheral configuration ########################## */

/* CRC FEATURE: Use to activate CRC feature inside HAL SPI Driver
* Activated: CRC code is present inside driver
* Deactivated: CRC code cleaned from driver
*/

	#define USE_SPI_CRC 1U

/* Includes ------------------------------------------------------------------*/
/**
  * @brief Include module's header file 
  */

	#ifdef HAL_RCC_MODULE_ENABLED
		#include "stm32f7xx_hal_rcc.h"
	#endif /* HAL_RCC_MODULE_ENABLED */

	#ifdef HAL_GPIO_MODULE_ENABLED
		#include "stm32f7xx_hal_gpio.h"
	#endif /* HAL_GPIO_MODULE_ENABLED */

	#ifdef HAL_DMA_MODULE_ENABLED
		#include "stm32f7xx_hal_dma.h"
	#endif /* HAL_DMA_MODULE_ENABLED */

	#ifdef HAL_CORTEX_MODULE_ENABLED
		#include "stm32f7xx_hal_cortex.h"
	#endif /* HAL_CORTEX_MODULE_ENABLED */

	#ifdef HAL_ADC_MODULE_ENABLED
		#include "stm32f7xx_hal_adc.h"
	#endif /* HAL_ADC_MODULE_ENABLED */

	#ifdef HAL_CAN_MODULE_ENABLED
		#include "stm32f7xx_hal_can.h"
	#endif /* HAL_CAN_MODULE_ENABLED */

	#ifdef HAL_CAN_LEGACY_MODULE_ENABLED
		#include "stm32f7xx_hal_can_legacy.h"
	#endif /* HAL_CAN_LEGACY_MODULE_ENABLED */

	#ifdef HAL_CEC_MODULE_ENABLED
		#include "stm32f7xx_hal_cec.h"
	#endif /* HAL_CEC_MODULE_ENABLED */

	#ifdef HAL_CRC_MODULE_ENABLED
		#include "stm32f7xx_hal_crc.h"
	#endif /* HAL_CRC_MODULE_ENABLED */

	#ifdef HAL_CRYP_MODULE_ENABLED
		#include "stm32f7xx_hal_cryp.h"
	#endif /* HAL_CRYP_MODULE_ENABLED */

	#ifdef HAL_DMA2D_MODULE_ENABLED
		#include "stm32f7xx_hal_dma2d.h"
	#endif /* HAL_DMA2D_MODULE_ENABLED */

	#ifdef HAL_DAC_MODULE_ENABLED
		#include "stm32f7xx_hal_dac.h"
	#endif /* HAL_DAC_MODULE_ENABLED */

	#ifdef HAL_DCMI_MODULE_ENABLED
		#include "stm32f7xx_hal_dcmi.h"
	#endif /* HAL_DCMI_MODULE_ENABLED */

	#ifdef HAL_ETH_MODULE_ENABLED
		#include "stm32f7xx_hal_eth.h"
	#endif /* HAL_ETH_MODULE_ENABLED */

	#ifdef HAL_FLASH_MODULE_ENABLED
		#include "stm32f7xx_hal_flash.h"
	#endif /* HAL_FLASH_MODULE_ENABLED */

	#ifdef HAL_SRAM_MODULE_ENABLED
		#include "stm32f7xx_hal_sram.h"
	#endif /* HAL_SRAM_MODULE_ENABLED */

	#ifdef HAL_NOR_MODULE_ENABLED
		#include "stm32f7xx_hal_nor.h"
	#endif /* HAL_NOR_MODULE_ENABLED */

	#ifdef HAL_NAND_MODULE_ENABLED
		#include "stm32f7xx_hal_nand.h"
	#endif /* HAL_NAND_MODULE_ENABLED */

	#ifdef HAL_SDRAM_MODULE_ENABLED
		#include "stm32f7xx_hal_sdram.h"
	#endif /* HAL_SDRAM_MODULE_ENABLED */

	#ifdef HAL_HASH_MODULE_ENABLED
		#include "stm32f7xx_hal_hash.h"
	#endif /* HAL_HASH_MODULE_ENABLED */

	#ifdef HAL_I2C_MODULE_ENABLED
		#include "stm32f7xx_hal_i2c.h"
	#endif /* HAL_I2C_MODULE_ENABLED */

	#ifdef HAL_I2S_MODULE_ENABLED
		#include "stm32f7xx_hal_i2s.h"
	#endif /* HAL_I2S_MODULE_ENABLED */

	#ifdef HAL_IWDG_MODULE_ENABLED
		#include "stm32f7xx_hal_iwdg.h"
	#endif /* HAL_IWDG_MODULE_ENABLED */

	#ifdef HAL_LPTIM_MODULE_ENABLED
		#include "stm32f7xx_hal_lptim.h"
	#endif /* HAL_LPTIM_MODULE_ENABLED */

	#ifdef HAL_LTDC_MODULE_ENABLED
		#include "stm32f7xx_hal_ltdc.h"
	#endif /* HAL_LTDC_MODULE_ENABLED */

	#ifdef HAL_PWR_MODULE_ENABLED
		#include "stm32f7xx_hal_pwr.h"
	#endif /* HAL_PWR_MODULE_ENABLED */

	#ifdef HAL_QSPI_MODULE_ENABLED
		#include "stm32f7xx_hal_qspi.h"
	#endif /* HAL_QSPI_MODULE_ENABLED */

	#ifdef HAL_RNG_MODULE_ENABLED
		#include "stm32f7xx_hal_rng.h"
	#endif /* HAL_RNG_MODULE_ENABLED */

	#ifdef HAL_RTC_MODULE_ENABLED
		#include "stm32f7xx_hal_rtc.h"
	#endif /* HAL_RTC_MODULE_ENABLED */

	#ifdef HAL_SAI_MODULE_ENABLED
		#include "stm32f7xx_hal_sai.h"
	#endif /* HAL_SAI_MODULE_ENABLED */

	#ifdef HAL_SD_MODULE_ENABLED
		#include "stm32f7xx_hal_sd.h"
	#endif /* HAL_SD_MODULE_ENABLED */

	#ifdef HAL_SPDIFRX_MODULE_ENABLED
		#include "stm32f7xx_hal_spdifrx.h"
	#endif /* HAL_SPDIFRX_MODULE_ENABLED */

	#ifdef HAL_SPI_MODULE_ENABLED
		#include "stm32f7xx_hal_spi.h"
	#endif /* HAL_SPI_MODULE_ENABLED */

