4ms/mdrivlib/tests/ext/HAL/stm32f7xx_hal_conf.h
	#ifdef HAL_TIM_MODULE_ENABLED
		#include "stm32f7xx_hal_tim.h"
	#endif /* HAL_TIM_MODULE_ENABLED */

	#ifdef HAL_UART_MODULE_ENABLED
		#include "stm32f7xx_hal_uart.h"
	#endif /* HAL_UART_MODULE_ENABLED */

	#ifdef HAL_USART_MODULE_ENABLED
		#include "stm32f7xx_hal_usart.h"
	#endif /* HAL_USART_MODULE_ENABLED */

	#ifdef HAL_IRDA_MODULE_ENABLED
		#include "stm32f7xx_hal_irda.h"
	#endif /* HAL_IRDA_MODULE_ENABLED */

	#ifdef HAL_SMARTCARD_MODULE_ENABLED
		#include "stm32f7xx_hal_smartcard.h"
	#endif /* HAL_SMARTCARD_MODULE_ENABLED */

	#ifdef HAL_WWDG_MODULE_ENABLED
		#include "stm32f7xx_hal_wwdg.h"
	#endif /* HAL_WWDG_MODULE_ENABLED */

	#ifdef HAL_PCD_MODULE_ENABLED
		#include "stm32f7xx_hal_pcd.h"
	#endif /* HAL_PCD_MODULE_ENABLED */

	#ifdef HAL_HCD_MODULE_ENABLED
		#include "stm32f7xx_hal_hcd.h"
	#endif /* HAL_HCD_MODULE_ENABLED */

	#ifdef HAL_DFSDM_MODULE_ENABLED
		#include "stm32f7xx_hal_dfsdm.h"
	#endif /* HAL_DFSDM_MODULE_ENABLED */

	#ifdef HAL_DSI_MODULE_ENABLED
		#include "stm32f7xx_hal_dsi.h"
	#endif /* HAL_DSI_MODULE_ENABLED */

	#ifdef HAL_JPEG_MODULE_ENABLED
		#include "stm32f7xx_hal_jpeg.h"
	#endif /* HAL_JPEG_MODULE_ENABLED */

	#ifdef HAL_MDIOS_MODULE_ENABLED
		#include "stm32f7xx_hal_mdios.h"
	#endif /* HAL_MDIOS_MODULE_ENABLED */

	#ifdef HAL_SMBUS_MODULE_ENABLED
		#include "stm32f7xx_hal_smbus.h"
	#endif /* HAL_SMBUS_MODULE_ENABLED */

	#ifdef HAL_MMC_MODULE_ENABLED
		#include "stm32f7xx_hal_mmc.h"
	#endif /* HAL_MMC_MODULE_ENABLED */

	/* Exported macro ------------------------------------------------------------*/
	#ifdef USE_FULL_ASSERT
	/**
  * @brief  The assert_param macro is used for function's parameters check.
  * @param  expr If expr is false, it calls assert_failed function
  *         which reports the name of the source file and the source
  *         line number of the call that failed. 
  *         If expr is true, it returns no value.
  * @retval None
  */
		#define assert_param(expr) ((expr) ? (void)0 : assert_failed((uint8_t *)__FILE__, __LINE__))
/* Exported functions ------------------------------------------------------- */
void assert_failed(uint8_t *file, uint32_t line);
	#else
		#define assert_param(expr) ((void)0U)
	#endif /* USE_FULL_ASSERT */

	#ifdef __cplusplus
}
	#endif

#endif /* __STM32F7xx_HAL_CONF_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
